Revit 2026 API

# DGNExportOptions Class

---

The export options used by exporting DGN format file.

SystemObject Autodesk.Revit.DBBaseExportOptions Autodesk.Revit.DBDGNExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DGNExportOptions : BaseExportOptions
```
```vb
Public Class DGNExportOptions
	Inherits BaseExportOptions
```
```cpp
public ref class DGNExportOptions : public BaseExportOptions
```
```fsharp
type DGNExportOptions =
    class
        inherit BaseExportOptions
    end
```

The DGNExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DGNExportOptions | Constructs a new instance of DGNExportOptions with default values of all properties. |
|  | DGNExportOptions(DGNExportOptions) | Constructs a new instance of DGNExportOptions as a copy of the export options. |

|  | Name | Description |
| --- | --- | --- |
|  | Colors | Export color mode. Default value is ExportColorMode.IndexColors. (Inherited from BaseExportOptions) |
|  | FileVersion | The DGN file version. Default value of fileVersion is DGNFileFormat.Default. |
|  | HatchPatternsFileName | Custom hatch patterns (pat) file name. (Inherited from BaseExportOptions) |
|  | HideReferencePlane | Whether or not to hide reference planes. Default value is false. (Inherited from BaseExportOptions) |
|  | HideScopeBox | Whether or not to hide the scope box. Default value is false. (Inherited from BaseExportOptions) |
|  | HideUnreferenceViewTags | Whether or not to hide unreference view tags. Default value is false. (Inherited from BaseExportOptions) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BaseExportOptions) |
|  | LayerMapping | Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization. (Inherited from BaseExportOptions) |
|  | MergedViews | Whether to merge all views in one file (via XRefs). Default value of mergedViews is false. |
|  | PreserveCoincidentLines | Whether or not to preserve coincident lines. Default value is false. (Inherited from BaseExportOptions) |
|  | PropOverrides | How to export overridden object styles. Default value is PropOverrideMode.ByEntity. (Inherited from BaseExportOptions) |
|  | SeedName | The name of the DGN seed. Default value of seedName is empty. |
|  | WorkingUnits | If true, Main Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from BaseExportOptions) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExportFontTable | Gets font table. (Inherited from BaseExportOptions) |
|  | GetExportLayerTable | Gets the layer table. (Inherited from BaseExportOptions) |
|  | GetExportLinetypeTable | Gets a copy of the line type table. (Inherited from BaseExportOptions) |
|  | GetExportLineweightTable | Gets a copy of the line weight table. |
|  | GetExportPatternTable | Gets a copy of the pattern table. (Inherited from BaseExportOptions) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPredefinedOptions | Returns an instance DGNExportOptions containing settings from a predefined export setup. |
|  | GetPredefinedSetupNames | Returns a list of names of predefined setups of DGN export options. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetExportFontTable | Sets font table to option. (Inherited from BaseExportOptions) |
|  | SetExportLayerTable | Sets layer table back to option (Inherited from BaseExportOptions) |
|  | SetExportLinetypeTable | Sets the line type table to use during export. (Inherited from BaseExportOptions) |
|  | SetExportLineweightTable | Sets the line weight table to use during export. |
|  | SetExportPatternTable | Sets the pattern table to use during export. (Inherited from BaseExportOptions) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace